const 矩陣 = require('./src/矩陣')

let m1 = new 矩陣([1, 2, 3], [4, 5, 6], [7, 8, 9])
console.log(m1) // 矩陣(3) [ [ 1, 2, 3 ], [ 4, 5, 6 ], [ 7, 8, 9 ] ]

let m2 = m1.加(3)
console.log(m1)         // 矩陣(3) [ [ 1, 2, 3 ], [ 4, 5, 6 ], [ 7, 8, 9 ] ]
console.log(m2)         // 矩陣(3) [ [ 4, 5, 6 ], [ 7, 8, 9 ], [ 10, 11, 12 ] ]
console.log(m2.總和())   // 72
console.log(m2.橫列(0))  // 向量(3) [ 4, 5, 6 ]
console.log(m2.直行(0))  // 向量(3) [ 4, 7, 10 ]

let m3 = m1.乘(m2)
console.log(m3)         // 矩陣(3) [ [ 48, 54, 60 ], [ 111, 126, 141 ], [ 174, 198, 222 ] ]

const m = new 矩陣([1, 2, 3], [4, 5, 6])
const t = m.轉置()
console.log(t)          // 矩陣(3) [ [ 1, 4 ], [ 2, 5 ], [ 3, 6 ] ]
